src/cf/InformationRegisters/ЦППК_ОценкиДействийЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦППК_ОценкиДействийЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДействиеЗадачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЦППК_ОценкиДействийЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает значение оценки по ссылке действия задачи.
Функция ОценкаДействияЗадачи(ДействиеЗадачи) Экспорт
	
	Если ДействиеЗадачи.Пустая() Тогда
		Возврат 0;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦППК_ОценкиДействийЗадач.Оценка КАК Оценка
	|ИЗ
	|	РегистрСведений.ЦППК_ОценкиДействийЗадач КАК ЦППК_ОценкиДействийЗадач
	|ГДЕ
	|	ЦППК_ОценкиДействийЗадач.ДействиеЗадачи = &ДействиеЗадачи";
	
	Запрос.УстановитьПараметр("ДействиеЗадачи", ДействиеЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Оценка;
	
КонецФункции

// Создает запись или обновляет текущую запись оценки действия задачи.
Процедура ЗаписатьОбновитьОценкуДействияЗадачи(ДействиеЗадачи, Оценка) Экспорт
	
	Если ДействиеЗадачи.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	//++AxelSoft NM 12.08.2024 САНФ-027688
	//Если НЕ РольДоступна("ЦППК_УказаниеОценкиПриСогласовании") Тогда
	Если НЕ РольДоступна("ЦППК_УказаниеОценкиПриСогласовании") И НЕ РольДоступна("АдминистраторСистемы") И НЕ РольДоступна("ПолныеПрава") Тогда
	//--AxelSoft NM 12.08.2024 САНФ-027688
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДействиеЗадачи, "ВидДействия") <> Справочники.ВидыДействийЗадач.Согласовать Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ЦППК_ОценкиДействийЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДействиеЗадачи = ДействиеЗадачи;
	МенеджерЗаписи.Оценка = Оценка;
	МенеджерЗаписи.Записать();

КонецПроцедуры			

#КонецОбласти

#КонецЕсли
